PKS1C/src/Reports/ОтчетДатКлючевыхНосителей/ОтчетДатКлючевыхНосителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетДатКлючевыхНосителей</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ДатыКлючевыеНосители/ДатыКлючевыеНосители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыКлючевыеНосители</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>RSAС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>RSAДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГОСТДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КлючевойНоситель</name>
    <type>
      <types>CatalogRef.КлючевыеНосители</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ОтчетДатКлючевыхНосителей/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере(ТабДок, ВидОтчета)
	ТабДок.Очистить();
	
	Истекающие = 0;
	Неистекающие = 0;
	
	Макет = Отчеты.ОтчетДатКлючевыхНосителей.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	
	ТабДок.Вывести(ОбластьШапка);
	
	ЗапросДат = Новый Запрос;
	ЗапросДат.Текст = 
		"ВЫБРАТЬ
		|	ДатыКлючевыеНосителиСрезПоследних.RSAС КАК RSAС,
		|	ДатыКлючевыеНосителиСрезПоследних.RSAДо КАК RSAДо,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТС КАК ГОСТС,
		|	ДатыКлючевыеНосителиСрезПоследних.ГОСТДо КАК ГОСТДо,
		|	ДатыКлючевыеНосителиСрезПоследних.Регистратор.Дата КАК Дата,
		|	ДатыКлючевыеНосителиСрезПоследних.КлючевойНоситель КАК КлючевойНоситель
		|ИЗ
		|	РегистрСведений.ДатыКлючевыеНосители.СрезПоследних(, ) КАК ДатыКлючевыеНосителиСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГОСТДо";	
	РезультатЗапросаДат = ЗапросДат.Выполнить();	
	ВыборкаДат = РезультатЗапросаДат.Выбрать();
	
	Пока ВыборкаДат.Следующий() Цикл
		ОбластьСтрока.Параметры.Дата = Формат(ВыборкаДат.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Рутокен = ВыборкаДат.КлючевойНоситель;
		ОбластьСтрока.Параметры.ГОСТС = Формат(ВыборкаДат.ГОСТС, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.ГОСТДо = Формат(ВыборкаДат.ГОСТДо, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.RSAС = Формат(ВыборкаДат.RSAС, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.RSAДо = Формат(ВыборкаДат.RSAДо, "ДФ=дд.ММ.гггг");
		
		Если ВыборкаДат.RSAДо - ТекущаяДата() >= 30 * 24 * 60 * 60 И ВыборкаДат.ГОСТДо - ТекущаяДата() >= 30 * 24 * 60 * 60 Тогда
				Неистекающие = Неистекающие + 1;
				Если ВидОтчета = "2" Тогда
					Продолжить;
				КонецЕсли;
		Иначе
			Истекающие = Истекающие + 1;
			Если ВидОтчета = "1" Тогда
				Область= ТабДок.Область("R" + Строка(Истекающие + Неистекающие + 3) + "C2:R" +  Строка(Истекающие + Неистекающие + 3) + "C8");
				Область.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
			КонецЕсли;
		КонецЕсли;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	ОбластьИтоги.Параметры.Истекающих = Истекающие;
	ОбластьИтоги.Параметры.Неистекающих = Неистекающие;
	ТабДок.Вывести(ОбластьИтоги);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ТабДок, ВидОтчета);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидОтчета = "2";
	СформироватьНаСервере(ТабДок, ВидОтчета);
КонецПроцедуры
